# TotalViews Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPrintingEventArgs..::..TotalViews Property
ViewPrintingEventArgs Class See Also
---
The number of all views being printed.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public int TotalViews { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalViews As Integer
	Get
```

Visual C++
---
```text
public:
property int TotalViews {
	int get ();
}
```

# See Also
ViewPrintingEventArgs Class
Autodesk.Revit.DB.Events Namespace